etc/templates/closedVolumeRotating/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MRF1
{
    type            MRFSource;
    selectionMode   cellZone;
    cellZone        rotatingZone;
    active          yes;

    MRFSourceCoeffs
    {
        #include "${FOAM_CASE}/constant/rotatingZoneProperties"
    }
}

// ************************************************************************* //
